use DesignPatterns

go

insert into Questions(Name, Pattern_Id, question)
values 
	('1 хокаге', 1, 'Хто був 1 хокаге'),
	('2 хокаге', 1, 'Хто був 2 хокаге'),
	('3 хокаге', 1, 'Хто був 3 хокаге'),
	('4 хокаге', 1, 'Хто був 4 хокаге'),
	('5 хокаге', 1, 'Хто був 5 хокаге');

insert into Answers(question_Id, IsTrue, answer)
values 
	(1, 0, 'Какаші Хатаке'), (1, 0, 'Конохамару Сарутобі'), (1, 0, 'Неджи Х’юга'), (1, 1, 'Хаширама Сенджу'), 
	(2, 0, 'Мадара Учіха'), (2, 0, 'Ізуна Учіха'), (2, 0, 'Кушина Узумакі'), (2, 1, 'Тобірама Сенджу'), 
	(3, 0, 'Асума Сарутобі'), (3, 0, 'Іно Яманака'), (3, 0, 'Какузу Аніміру'), (3, 1, 'Сарутобі Хірузен'), 
	(4, 0, 'Ітачі Учіха'), (4, 0, 'Нагато Узумакі'), (4, 0, 'Кісаме Хочігаке'), (4, 1, 'Мінато Намікадзе'), 
	(5, 0, 'Орочімару'), (5, 0, 'Джирайя'), (5, 0, 'Наруто Узумакі'), (5, 1, 'Тсунаде Сенджу');